app/Models/ModelJabatan.php

SELECT *
FROM `tbl_jabatan`
---
    public function allData()
    {
        return $this->db->table('tbl_jabatan')->get()->getResultArray();