app/Models/ModelHome.php

    public function dataKaryawan()
    {
        return $this->db->table('tbl_karyawan')
        ->join('tbl_jabatan', 'tbl_jabatan.id_jabatan=tbl_karyawan.id_jabatan', 'LEFT')
        ->where('id_karyawan', session()->get('id_karyawan'))->get()->getRowArray();
---
SELECT *
FROM `tbl_karyawan`
LEFT JOIN `tbl_jabatan` ON `tbl_jabatan`.`id_jabatan`=`tbl_karyawan`.`id_jabatan`
WHERE `id_karyawan` = '5'

    public function cekPresensi()
    {
        return $this->db->table('tbl_presensi')
        ->where('id_karyawan', session()->get('id_karyawan'))
        ->where('tgl_presensi', date('Y-m-d'))
        ->get()->getRowArray();
---
SELECT *
FROM `tbl_presensi`
WHERE `id_karyawan` = '5'
AND `tgl_presensi` = '2024-06-23'

    public function presensiPerbulan(){
        return $this->db->table('tbl_presensi')
        ->where('id_karyawan', session()->get('id_karyawan'))
        ->where('month(tgl_presensi)', date('m'))
        ->where('year(tgl_presensi)', date('Y'))
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_presensi`
WHERE `id_karyawan` = '5'
AND month(tgl_presensi) = '06'
AND year(tgl_presensi) = '2024'

    public function leaderboard(){
        return $this->db->table('tbl_presensi')
        ->join('tbl_karyawan', 'tbl_karyawan.id_karyawan = tbl_presensi.id_karyawan', 'LEFT')
        ->join('tbl_jabatan', 'tbl_jabatan.id_jabatan=tbl_karyawan.id_jabatan', 'LEFT')
        ->where('tgl_presensi', date('Y-m-d'))
        ->orderBy('tbl_presensi.Id_presensi', 'DESC')
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_presensi`
LEFT JOIN `tbl_karyawan` ON `tbl_karyawan`.`id_karyawan` = `tbl_presensi`.`id_karyawan`
LEFT JOIN `tbl_jabatan` ON `tbl_jabatan`.`id_jabatan`=`tbl_karyawan`.`id_jabatan`
WHERE `tgl_presensi` = '2024-06-23'
ORDER BY `tbl_presensi`.`Id_presensi` DESC

    public function historyPresensi($bulan, $tahun){
        return $this->db->table('tbl_presensi')
        ->where('id_karyawan', session()->get('id_karyawan'))
        ->where('month(tgl_presensi)', $bulan)
        ->where('year(tgl_presensi)', $tahun)
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_presensi`
WHERE `id_karyawan` = '5'
AND month(tgl_presensi) = '6'
AND year(tgl_presensi) = '2024'