app/Models/ModelKaryawan.php

SELECT *
FROM `tbl_karyawan`
LEFT JOIN `tbl_jabatan` ON `tbl_jabatan`.`id_jabatan`=`tbl_karyawan`.`id_jabatan`
---
    public function allData()
    {
        return $this->db->table('tbl_karyawan')
        ->join('tbl_jabatan', 'tbl_jabatan.id_jabatan=tbl_karyawan.id_jabatan', 'LEFT')
        ->get()->getResultArray();

INSERT INTO `tbl_karyawan` (`id_jabatan`, `nik`, `nama_karyawan`, `username`, `password`, `foto_karyawan`) VALUES ('2', '1234234', 'Hazim', 'Hazim', '7c4a8d09ca3762af61e59520943dc26494f8941b', '1686789213_2267c426eebdb6022d4a.jpg')
---
    public function insertData($data)
    {
        $this->db->table('tbl_karyawan')->insert($data);

UPDATE `tbl_karyawan` SET `id_karyawan` = '1', `id_jabatan` = '4', `nik` = '123456 72', `nama_karyawan` = 'Mukhlis Rambe edit 2', `username` = 'Mukhlis R2', `password` = 'da39a3ee5e6b4b0d3255bfef95601890afd80709', `foto_karyawan` = '1686790070_92dbe0b7fc8d32e92a2d.jpg'
WHERE `id_karyawan` = '1'
---
    public function updateData($data)
    {
        $this->db->table('tbl_karyawan')
        ->where('id_karyawan', $data['id_karyawan'])
        ->update($data);

DELETE FROM `tbl_karyawan`
WHERE `id_karyawan` = '4'
AND `id_karyawan` = '4'
---
    public function deleteData($data)
    {
        $this->db->table('tbl_karyawan')
        ->where('id_karyawan', $data['id_karyawan'])
        ->delete($data);